In [3]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [4]:
animals = DataFrame(np.arange(16).reshape(4,4),
                   columns=['W','X','Y','Z'],
                   index=['Dog','Cat','Bird','Mouse'])

In [5]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [7]:
animals.loc[1:2,['W','Y']] = np.nan
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [8]:
behaviar_map = {'W':'bad','X':'good','Y':'good','Z':'good'}

In [11]:
# mapを使ってグループ化する
animal_col = animals.groupby(behaviar_map,axis=1)
animal_col.sum()

        bad  good
Dog     0.0   6.0
Cat     0.0  12.0
Bird    8.0  30.0
Mouse  12.0  42.0

In [12]:
behav_series = Series(behaviar_map)
behav_series

W     bad
X    good
Y    good
Z    good
dtype: object

In [13]:
# Seriesを使ってグループ化する
animals.groupby(behav_series, axis=1).count()

       bad  good
Dog      1     3
Cat      0     2
Bird     1     3
Mouse    1     3

In [14]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15

In [16]:
# 関数を使ってグループ化
animals.groupby(len).sum()

      W   X     Y   Z
3   0.0   6   2.0  10
4   8.0   9  10.0  11
5  12.0  13  14.0  15

In [17]:
# 関数とキーを混ぜてグループ化
keys = ['A','B','A','B']
# indexの長さと別のキーを使う
animals.groupby([len, keys]).max()

        W   X     Y   Z
3 A   0.0   1   2.0   3
  B   NaN   5   NaN   7
4 A   8.0   9  10.0  11
5 B  12.0  13  14.0  15